app/controllers/artists_controller.rb

  def about
    p params
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]