app/controllers/photo_galleries_controller.rb

  def all
    @artist = Artist.find(1)
    @photos = Photo.where(artist_id: @artist.id)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."artist_id" = $1  [["artist_id", 1]]

  def portraits
    @artist = Artist.find(1)
    @photo_gallery = PhotoGallery.where(title: 'Portraits', artist_id: @artist.id).first
    @photos = @photo_gallery.photos.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."title" = $1 AND "photo_galleries"."artist_id" = $2 ORDER BY "photo_galleries"."id" ASC LIMIT $3  [["title", "portraits"], ["artist_id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."photo_gallery_id" = $1  [["photo_gallery_id", 1]]